hotRoom4D_corrections/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "ABLConditions"
        value           uniform 0;
    }
    ground
    {
        type            atmEpsilonWallFunction;
        z0              uniform 0.02;
        value           uniform 0;
    }
    wtwalls
    {
        type            symmetry;
    }
    top
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "ABLConditions"
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
    buildingFaces_master
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
    buildingFaces_slave
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
